# -*- mode: org; -*-

#+CATEGORY: STAGE

#+begin_src emacs-lisp :results none :export none
  (org-babel-tangle-file "README.org")
#+end_src

Le dossier contient les données du séquençage des deux plaques envoyées à la
suite des manips de Florence. 

*** DONE Néomutations [1/1]
CLOSED: [2015-11-27 Fri 23:53]
- [X] rajouter le filtre sur les positions calibrées. 

Le but est de trouver les SNPs aux positions calibrées qui ne sont pas ceux
attendus. Typiquement ce sont les mutations /strong/ dans la manip Weak, et les
mutations /weak/ dans la manip Strong. Si les mutations en questions sont
répétées sur l'ensemble du clone, alors c'est une contamination. Sinon, ce sont
des données intéressantes. 

#+BEGIN_SRC R :tangle ./scripts/variant_analysis.R
  ##============================================================================== 
  ## OUTLIERS
  ##==============================================================================
  ##
  ##' .. content for \description{} (no empty lines) ..
  ##' 
  ##' Détermine si le SNP en question est un outlier ou non, c'est à dire une
  ##' mutation strong chez un mutant weak ou inversement.
  ##' 
  ##' .. content for \details{} ..
  ##' @title is_outlier
  ##' @param mutant : le type de mutant
  ##' @param mutation_type : le type de substitution
  ##' @return 
  is_outlier <- function(mutant, mutation_type)
  {
      if (mutant == 'strong' && mutation_type == 'SW') {
          "non"
      } else if (mutant == 'weak' && mutation_type == 'WS') {
          "non"
      } else {
          'oui'
      }
  }

  snp %>%
      ## par ligne, determine si la position est inattendue
      rowwise() %>%
      mutate(attendu = is_outlier(mutant, mutation_type)) %>%
      ungroup() %>%
      ## garde les positions calibree
      filter(position == "oui") %>% 
      ## sur lesquelles le résultat est inattendu
      filter(attendu == "non") %>%
      plot_snp(legend_position = c(0.2, 0.9)) +
      geom_text(aes(label = name, y = 0.5), check_overlap = TRUE,
                position = "dodge") +
      coord_flip() +
      theme(panel.ontop = FALSE)

  ## sortie des résultats dans un joli tableau latex
  sink( file = "../../analysis/outlier.tex", append = FALSE)
  snp %>%
      rowwise() %>%
      mutate(attendu = is_outlier(mutant, mutation_type)) %>%
      ungroup() %>%
      filter(attendu == "non") %>%
      mutate(position = offset_on_subject, ref = s_base, read = q_base) %>%
      select(-read_name, -offset_on_subject, -s_base, -q_base) %>%
      knitr::kable(format = "latex", booktabs = TRUE)
  sink()

  ## pdf(file = "../../analysis/outliers.pdf", width = 4, height = 2)
#+END_SRC

La liste des constructions qui montrent des néo-mutations :
#+BEGIN_SRC R 
  library(dplyr)

  read.csv("~/stage/seq_novembre/data/variantCalling/snp_table.csv") %>%
    filter(position == "non") %>%
    select(name) %>%
    unique()
#+END_SRC

#+RESULTS:
| pS10-1073 |
| pS24-1073 |
| pS30-1073 |
| pS39-1073 |
| pS5-1073  |
| pS54-1073 |
| pS74-1073 |
| pS82-1073 |
| pS88-1073 |
| pW14-1073 |
| pW19-1073 |
| pW2-1073  |
| pW23-1073 |
| pW35-1073 |
| pW6-1073  |
| pW81-1073 |
| pW87-1073 |
| pW93-1073 |

